# 21.IPsec VPN

# MAC地址

- mac地址有48位，通常表示为点分16进制 
- mac地址全球唯一，由IEEE对这些地址进行管理 
- 每个地址由两部分租场，分别是供应商代码和序列号。其中前24位代表的是供应商，剩下的24位代 表的是序列号

![image-20220502162424747](http://cdn.gtrinee.top/image-20220502162424747.png)

## 交换机工作机制 

1. 读取数据帧头部的源MAC地址，并且将接口和MAC地址记录到MAC地址表  
2. 读取数据帧头部的目的MAC地址，并且和自己的MAC地址表进行对应 
   1. 匹配成功，则从对应的接口发出 2.
   2.  没有匹配成功，则会从收到的那个接口之外的所有接口发出 
3.  广播或者组播地址，则会从收到的那个接口之外的所有接口发出

## 路由器工作机制 

1. 读取数据帧头部的源MAC地址，并且将接口和MAC地址记录到MAC地址表 
2. 读取数据帧头部的目的MAC地址，并且和自己的MAC地址表进行对应 
3. 匹配成功。打开IP报文，继续取IP地址 
4. 如果是自己则接受 
5. 如果不是自己根据路由表转发 
6.  没有匹配成功 
7. 丢弃

## LAN 

- 一般指**局域网** 
- 通常会使用到的**设备有网卡、集线器、交换机** 
- 一般是指**私有网络**

## VLAN

- 一个VLAN中所有设备都是在同一个**广播域内，不同的**
- VLAN是不同的广播域 VLAN之间相互隔离，**广播域不能跨越VLAN传播，不同的VLAN间需要通告三层设备实现互相通信** 
- 一个VLAN一般位一个逻辑子网，由多个VLAN设备 
- VLAN多基于交换机的**接口分配，划分**
- VLAN成员就是对交换机的接口划分 VLAN工作于OSI参考模型第二层
- **VLAN是二层交换机的一个根本的工作机制**

## 什么是WLAN？

无线局域网WLAN（Wireless Local Area Network）是一种无线计算机网络，使用无线信道代替有线传输介质连接两个或多个设备形成一个局域网LAN（Local Area Network），典型部署场景如家庭、学校、校园或企业办公楼等。WLAN是一个网络系统，而我们常见的[Wi-Fi](https://info.support.huawei.com/info-finder/encyclopedia/zh/WiFi.html)是这个网络系统中的一种技术。所以，WLAN和Wi-Fi之间是包含关系，WLAN包含了Wi-Fi。

![image-20220502163500896](http://cdn.gtrinee.top/image-20220502163500896.png)



## Trunk 

- 当一条链路，需要承载多条vlan信息的时候，需要使用trunk来实现 
- trunk两端采用相同的干道协议 
- 一般见于交换机之间或者交换机于路由器、服务器之间

![image-20220502163921322](http://cdn.gtrinee.top/image-20220502163921322.png)

- cisco私有 
- 支持PVST 
- 在原始的数据帧基础上装上ISL头以及新的FCS 
- 处理效率比802.1Q低 
- 最多支持1024个vlan

## 802.1Q

![image-20220502164138549](http://cdn.gtrinee.top/image-20220502164138549.png)

- IEEE共有协议 
- 插入tag字段，同时重新计算FCS

# 三层交换

##  vlan间的通信 

- vlan是将一个广播域给隔离成多个广播域互不干扰 
- 不同广播域的PC往往在可控的情况下是需要进行通信的，所以需要解决vlan之间的通信 

## 单臂路由 

- 单臂路由可以解决vlan间的通信问题 
- 但是这种方式第一不够安全可靠，成本较高 
- 这种方式往往是临时解决问题

![image-20220502164626664](http://cdn.gtrinee.top/image-20220502164626664.png)

![image-20220502164632794](http://cdn.gtrinee.top/image-20220502164632794.png)

```bash
第一步是将R1、R2配置不同网段的地址
第二步在交换机上将e-/1, e0/2接口划分至不同的vlan，将e0/3接口配置成窗口
第四步将R3的e0/0接口no sh，然后配置子接口的单臂路由
interface Ethernet0/0.10
encapsulation dot1Q 10
ip address 192.168.1.3 255.255.255.0
no shutdown
!
interface Ethernet0/0.20
encapsulation dot1Q 20
ip address 192.168.2.3 255.255.255.0
no shutdown

```

## 三层交换机 

- SVI交换式虚拟接口 
  - 可以通过int vlan 10的方式定义交换虚拟接口 
  - 被定义的该SVI接口是被自动放到指定的vlan中 
  - 默认如果没有物理接口在指定的vlan中时，SVI接口无法开启

### 综合实验

![image-20220502204518864](http://cdn.gtrinee.top/image-20220502204518864.png)

```bash
配置trunk
SW1(config)#int range e0/1 -2
SW1(config-if-range)#sw tr en do
SW1(config-if-range)#sw mo tr
=================================
SW2(config)#int range e0/1 -2
SW2(config-if-range)#sw tr en do
SW2(config-if-range)#sw mo tr
show vlan
将R6，R7对应的接口加入vlan
SW4(config)#int e0/1
SW4(config-if)#sw ac vl 46
===================
SW5(config)#int e0/2
SW5(config-if)#sw ac vl 57
配置路由协议
R6(config)#int lo0
R6(config-if)#ip add 6.6.6.6 255.255.255.0
R6(config-if)#ip ospf 1 area 0
R6(config-if)#int e0/0
R6(config-if)#ip add 192.168.46.6 255.255.255.0
R6(config-if)#no sh
R6(config-if)#ip ospf 1 area 0
=====================================
SW4(config-if)#int vlan 46
SW4(config-if)#ip add 192.168.46.4 255.255.255.0
SW4(config-if)#no sh
SW4(config-if)#int lo0
SW4(config-if)#ip add 4.4.4.4 255.255.255.0
SW4(config-if)#int range lo0 , vl 46
SW4(config-if-range)#ip ospf 1 area 0
SW4(config-if-range)#int vl 34
SW4(config-if)#ip add 192.168.34.4 255.255.255.0
SW4(config-if)#no sh
SW4(config-if)#ip ospf 1 area 0
=======================================
SW3(config)#int lo0
SW3(config-if)#ip add 3.3.3.3 255.255.255.0
SW3(config-if)#no sh
SW3(config-if)#ip ospf 1 area 0
SW3(config-if)#int vlan 34
SW3(config-if)#ip add 192.168.34.3 255.255.255.0
SW3(config-if)#no sh
SW3(config-if)#ip ospf 1 area 0
SW3(config-if)#int vl 23
SW3(config-if)#ip add 192.168.23.3 255.255.255.0
SW3(config-if)#no sh
SW3(config-if)#ip ospf 1 area 1
============================================
SW2(config)#int lo0
SW2(config-if)#ip add 2.2.2.2 255.255.255.0
SW2(config-if)#ip ospf 1 area 1
SW2(config-if)#int vl 23
SW2(config-if)#ip add 192.168.23.2 255.255.255.0
SW2(config-if)#no sh
SW2(config-if)#ip ospf 1 area 1
SW2(config-if)#int vl 12
SW2(config-if)#ip add 192.168.12.2 255.255.255.0
SW2(config-if)#no sh
SW2(config-if)#router isis
SW2(config-router)#net 49.0001.0000.0000.0002.00
SW2(config-router)#is-type level-2
SW2(config-router)#int vl 12
SW2(config-if)#ip router isis
==============================================
================================
SW3(config)#int range e0/1 -3, e1/1
SW3(config-if-range)#sw tr en do
SW3(config-if-range)#sw mo tr
================================
SW4(config)#int e0/2
SW4(config-if)#sw tr en do
SW4(config-if)#sw mo tr
================================
SW5(config)#int e0/1
SW5(config-if)#sw tr en do
SW5(config-if)#sw mo tr
配置vtp
SW3(config)#vtp do cisco
SW3(config)#vtp mo ser
==========================
除了Sw3外的交换机
vtp do cisco
vtp mo cl
创建vlan
SW3(config)#vlan 46,34,23,12,15,57
================================
去Sw3以外的交换机上检查是否同步vlan
show vlan
将R6，R7对应的接口加入vlan
SW4(config)#int e0/1
SW4(config-if)#sw ac vl 46
===================
SW5(config)#int e0/2
SW5(config-if)#sw ac vl 57
配置路由协议
R6(config)#int lo0
R6(config-if)#ip add 6.6.6.6 255.255.255.0
R6(config-if)#ip ospf 1 area 0
R6(config-if)#int e0/0
R6(config-if)#ip add 192.168.46.6 255.255.255.0
R6(config-if)#no sh
R6(config-if)#ip ospf 1 area 0
=====================================
SW4(config-if)#int vlan 46
SW4(config-if)#ip add 192.168.46.4 255.255.255.0
SW4(config-if)#no sh
SW4(config-if)#int lo0
SW4(config-if)#ip add 4.4.4.4 255.255.255.0
SW4(config-if)#int range lo0 , vl 46
SW4(config-if-range)#ip ospf 1 area 0
SW4(config-if-range)#int vl 34
SW4(config-if)#ip add 192.168.34.4 255.255.255.0
SW4(config-if)#no sh
SW4(config-if)#ip ospf 1 area 0
=======================================
SW3(config)#int lo0
SW3(config-if)#ip add 3.3.3.3 255.255.255.0
SW3(config-if)#no sh
SW3(config-if)#ip ospf 1 area 0
SW3(config-if)#int vlan 34
SW3(config-if)#ip add 192.168.34.3 255.255.255.0
SW3(config-if)#no sh
SW3(config-if)#ip ospf 1 area 0
SW3(config-if)#int vl 23
SW3(config-if)#ip add 192.168.23.3 255.255.255.0
SW3(config-if)#no sh
SW3(config-if)#ip ospf 1 area 1
============================================
SW2(config)#int lo0
SW2(config-if)#ip add 2.2.2.2 255.255.255.0
SW2(config-if)#ip ospf 1 area 1
SW2(config-if)#int vl 23
SW2(config-if)#ip add 192.168.23.2 255.255.255.0
SW2(config-if)#no sh
SW2(config-if)#ip ospf 1 area 1
SW2(config-if)#int vl 12
SW2(config-if)#ip add 192.168.12.2 255.255.255.0
SW2(config-if)#no sh
SW2(config-if)#router isis
SW2(config-router)#net 49.0001.0000.0000.0002.00
SW2(config-router)#is-type level-2
SW2(config-router)#int vl 12
SW2(config-if)#ip router isis
==============================================
SW1(config)#router isis
SW1(config-router)#net 49.0001.0000.0000.0001.00
SW1(config-router)#is-type level-2
SW1(config-router)#int lo0
SW1(config-if)#ip add 1.1.1.1 255.255.255.0
SW1(config-if)#ip router isis
SW1(config-if)#int vl 12
SW1(config-if)#ip add 192.168.12.1 255.255.255.0
SW1(config-if)#no sh
SW1(config-if)#ip router isis
SW1(config-if)#int vl 15
SW1(config-if)#ip add 192.168.15.1 255.255.255.0
SW1(config-if)#no sh
SW1(config-if)#router eigrp 100
SW1(config-router)#net 192.168.15.0
===============================================
SW5(config-if)#int lo0
SW5(config-if)#ip add 5.5.5.5 255.255.255.0
SW5(config-if)#int vl 15
SW5(config-if)#ip add 192.168.15.5 255.255.255.0
SW5(config-if)#no sh
SW5(config-if)#int vl 57
SW5(config-if)#ip add 192.168.57.5 255.255.255.0
SW5(config-if)#no sh
SW5(config-if)#router eigrp 100
SW5(config-router)#net 5.0.0.0
SW5(config-router)#net 192.168.15.0
SW5(config-router)#router rip
SW5(config-router)#ver 2
SW5(config-router)#no au
SW5(config-router)#net 192.168.57.0
==============================================
R7(config)#int lo0
R7(config-if)#ip add 7.7.7.7 255.255.255.0
R7(config-if)#int e0/1
R7(config-if)#ip add 192.168.57.7 255.255.255.0
R7(config-if)#no sh
R7(config-if)#router rip
R7(config-router)#ver 2
R7(config-router)#no au
R7(config-router)#net 7.0.0.0
R7(config-router)#net 192.168.57.0


检查ospf
SW4#sh ip ospf nei
Neighbor ID Pri State Dead Time Address Interface
3.3.3.3 1 FULL/BDR 00:00:38 192.168.34.3 Vlan34
6.6.6.6 1 FULL/DR 00:00:39 192.168.46.6 Vlan46
======================================
SW3#sh ip ospf nei
Neighbor ID Pri State Dead Time Address Interface
4.4.4.4 1 FULL/DR 00:00:36 192.168.34.4 Vlan34
2.2.2.2 1 FULL/BDR 00:00:38 192.168.23.2 Vlan23
=====================================
R6#sh ip route ospf
2.0.0.0/32 is subnetted, 1 subnets
O IA 2.2.2.2 [110/13] via 192.168.46.4, 00:00:32, Ethernet0/0
3.0.0.0/32 is subnetted, 1 subnets
O 3.3.3.3 [110/12] via 192.168.46.4, 00:00:32, Ethernet0/0
4.0.0.0/32 is subnetted, 1 subnets
O 4.4.4.4 [110/11] via 192.168.46.4, 00:00:32, Ethernet0/0
O IA 192.168.23.0/24 [110/12] via 192.168.46.4, 00:00:32, Ethernet0/0
O 192.168.34.0/24 [110/11] via 192.168.46.4, 00:00:32, Ethernet0/0
检查isis
SW2#sh ip route isis
1.0.0.0/24 is subnetted, 1 subnets
i L2 1.1.1.0 [115/20] via 192.168.12.1, 00:05:36, Vlan12
检查eigrp
SW1#sh ip route eigrp
5.0.0.0/24 is subnetted, 1 subnets
D 5.5.5.0 [90/130816] via 192.168.15.5, 00:04:30, Vlan15
检查rip
SW5#sh ip route rip
7.0.0.0/24 is subnetted, 1 subnets
R 7.7.7.0 [120/1] via 192.168.57.7, 00:00:09, Vlan57

做双向重发步
SW2(config)#router ospf 1
SW2(config-router)#red isis level-2 subnets
SW2(config-router)#router isis
SW2(config-router)#redistribute ospf 1 level-2
==========================
SW1(config)#router isis
SW1(config-router)#redistribute eigrp 100 level-2
SW1(config-router)#router eigrp 100
SW1(config-router)#redistribute isis metric 10000 100 255 1 1500
==========================
SW5(config)#router rip
SW5(config-router)#redistribute eigrp 100 metric 5
SW5(config-router)#router eigrp 100
SW5(config-router)#redistribute rip metric 10000 100 255 1 1500
检查路由
R6#sh ip route ospf
1.0.0.0/24 is subnetted, 1 subnets
O E2 1.1.1.0 [110/20] via 192.168.46.4, 00:01:25, Ethernet0/0
2.0.0.0/32 is subnetted, 1 subnets
O IA 2.2.2.2 [110/13] via 192.168.46.4, 00:04:45, Ethernet0/0
3.0.0.0/32 is subnetted, 1 subnets
O 3.3.3.3 [110/12] via 192.168.46.4, 00:04:45, Ethernet0/0
4.0.0.0/32 is subnetted, 1 subnets
O 4.4.4.4 [110/11] via 192.168.46.4, 00:04:45, Ethernet0/0
5.0.0.0/24 is subnetted, 1 subnets
O E2 5.5.5.0 [110/20] via 192.168.46.4, 00:01:01, Ethernet0/0
7.0.0.0/24 is subnetted, 1 subnets
O E2 7.7.7.0 [110/20] via 192.168.46.4, 00:00:19, Ethernet0/0
O E2 192.168.15.0/24 [110/20] via 192.168.46.4, 00:01:01, Ethernet0/0
O IA 192.168.23.0/24 [110/12] via 192.168.46.4, 00:04:45, Ethernet0/0
O 192.168.34.0/24 [110/11] via 192.168.46.4, 00:04:45, Ethernet0/0
O E2 192.168.57.0/24 [110/20] via 192.168.46.4, 00:00:19, Ethernet0/0

检查连通性
R6#ping 7.7.7.7
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 7.7.7.7, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 2/3/4 ms
R6#tr
R6#traceroute 7.7.7.7
Type escape sequence to abort.
Tracing the route to 7.7.7.7
VRF info: (vrf in name/id, vrf out name/id)
1 192.168.46.4 1 msec 0 msec 0 msec
2 192.168.34.3 1 msec 1 msec 1 msec
3 192.168.23.2 2 msec 2 msec 2 msec
4 192.168.12.1 3 msec 2 msec 1 msec
5 192.168.15.5 2 msec 3 msec 2 msec
6 192.168.57.7 3 msec * 5 msec
思考：真实的流量是按照traceroute的结果走的吗？如何解决？

```

# VPN的两种连接方式

- 站点到站点，主要是用于公司重要站点之间的连接 
  - IPsecVPN、MPLSVPN 
- 远程连接，常用于企业出差人员，在任意一个可以接入互联网的地方，连进企业内部网络 
  - SSLVPN、IPsecVPN、VPDN

# MPLS VPN和IPsecVPN

- MPLS VPN 

  - 优点 
    - 作为客户部署简单 
    - 带宽和延迟得到保障 
    - 跨地域连接也能得到保障稳定性 
    - 灵活扩展 
  - 缺点 
    - 策略需要与运营商协商 
    - 费用较为昂贵 

- IPsec VPN 

  - 优点 
    - 比较经济 
    - 灵活扩展 
    - 数据的加密安全 
  - 缺点 
    - 稳定性依赖于宽带服务商 
    - 作为客户需要专业技术人员部署

  

# GRE 

- 轻量级的隧道协议

![image-20220502210407039](http://cdn.gtrinee.top/image-20220502210407039.png)

- 头部 
  - 外部IP头部 
  - GRE头部 
  - 内层IP头部 
  - 实际传输的数据

![image-20220502211338158](http://cdn.gtrinee.top/image-20220502211338158.png)

```bash
配置运营商网络
R2
interface Loopback0
ip address 2.2.2.2 255.255.255.255
ip ospf 1 area 0
!
interface Ethernet0/0
ip address 192.168.12.2 255.255.255.0
!
interface Ethernet0/1
ip address 192.168.23.2 255.255.255.0
ip ospf 1 area 0
router ospf 1
redistribute connected subnets
========================
R3
interface Loopback0
ip address 3.3.3.3 255.255.255.0
ip ospf 1 area 0
!
interface Ethernet0/0
ip address 192.168.23.3 255.255.255.0
ip ospf 1 area 0
!
interface Ethernet0/1
ip address 192.168.34.3 255.255.255.0
ip ospf 1 area 0
=========================
R4
interface Loopback0
ip address 4.4.4.4 255.255.255.0
ip ospf 1 area 0
!
interface Ethernet0/0
ip address 192.168.34.4 255.255.255.0
ip ospf 1 area 0
!
interface Ethernet0/1
ip address 192.168.45.4 255.255.255.0
ip ospf 1 area 0
=========================
R5
interface Loopback0
ip address 5.5.5.5 255.255.255.0
ip ospf 1 area 0
!
interface Ethernet0/0
ip address 192.168.45.5 255.255.255.0
ip ospf 1 area 0
!
interface Ethernet0/1
ip address 192.168.56.5 255.255.255.0
router ospf 1
redistribute connected subnets
配置客户网络
R1
interface Loopback0
ip address 1.1.1.1 255.255.255.0
ip ospf 1 area 0
!
interface Tunnel0
ip address 172.16.16.1 255.255.255.0
ip ospf 1 area 0
tunnel source Ethernet0/0
tunnel destination 192.168.56.6
!
interface Ethernet0/0
ip address 192.168.12.1 255.255.255.0
==================
R6
interface Loopback0
ip address 6.6.6.6 255.255.255.0
ip ospf 1 area 0
!
interface Tunnel0
ip address 172.16.16.6 255.255.255.0
ip ospf 1 area 0
tunnel source Ethernet0/0
tunnel destination 192.168.12.1
!
interface Ethernet0/0
ip address 192.168.56.6 255.255.255.0
检查
R1#sh ip ospf nei
Neighbor ID Pri State Dead Time Address Interface
6.6.6.6 0 FULL/ - 00:00:31 172.16.16.6 Tunnel0
R1#sh ip route ospf
6.0.0.0/32 is subnetted, 1 subnets
O 6.6.6.6 [110/1001] via 172.16.16.6, 00:02:20, Tunnel0
R1#ping 6.6.6.6
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 6.6.6.6, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
```



# IPsec

- 是一项标准的安全技术，它是通过在数据包中插入一个预定义头部的方式来保障网络层数据安全

![image-20220502211432147](http://cdn.gtrinee.top/image-20220502211432147.png)

- 私密性 

  - 对数据进行加密 
  - 即使第三方截获数据，第三方也没有能力将其恢复为明文 

- 完整性 

  - 确保数据传输过程中不会被篡改 

- 源认证 

  - 确保是合法的源发送的此数据 
  - 接收方能够知道数据发送方是谁

  











